#!/bin/bash

#----------------------------------------------------
# File: param.sh
# Contents: 带参数的shell脚本参数处理方式.
# Date: 19-3-22
#----------------------------------------------------

#---------------------------------------------------------------------------------------------------
# 手动遍历
#---------------------------------------------------------------------------------------------------
arg_do_while() {
    while [[ $# -gt 0 ]]; do
        case "$1" in
            --mirror)
                echo "$2"
                # shift 等价于 shift 1
                shift
                ;;
            --dry-run)
                echo 1
                ;;
            --*)
                echo "Illegal option $1"
                ;;
        esac
        # 重置参数, shift N, 即将参数 $N+1, $N+2, ... 重置为 $1, $2, ..
        shift $(( $# > 0 ? 1 : 0 ))
    done
}

#---------------------------------------------------------------------------------------------------
# 使用getopts, 但是只支持短选项.
# -arg  // arg的值为空
# -arg value, -argvalue // arg的值是value
#
# getopts "arg1:arg2"
#---------------------------------------------------------------------------------------------------
arg_do_opts() {
    while getopts "a:bc" arg ; do #选项后面的冒号表示该选项需要参数
        case ${arg} in
             a)
                echo "a: $OPTARG" # 参数存在$OPTARG中
                ;;
             b)
                echo "b: $OPTARG"
                ;;
             c)
                echo "c: $OPTARG"
                ;;
             ?)  #当有不认识的选项的时候arg为?
                echo "unkonw argument"
                exit 1
                ;;
        esac
    done
}

arg_do_opts  -b -c -a hello