#!/bin/bash

#----------------------------------------------------
# File: ${NAME}
# Contents: root
# Date: 19-6-1
#----------------------------------------------------

#---------------------------------------------------------------------------------------------------
# Linux内核为用户空间提供了许多不同的通信方式.
#
# /sys 用于向用户暴露内核设备,驱动程序和其他内核信息
# /proc 用于向用户暴露内核设置, 进程和其他内核信息
# /dev 用于向用户暴露内核的设备节点
# /run 本地用户空间的socket和files
# /tmp 本地用户空间临时文件系统对象
#
# /sys/fs/cgroup 将内核控制组层次结构暴露给用户
# /sys/kernel/security, /sys/kernel/debug, /sys/kernel/config 将特殊的内核对象暴露给用户
# /sys/fs/selinux 将SELinux安全数据暴露给用户
# /sys/fs/fuse/connections 用于将内核FUSE连接暴露给用户
# /sys/firmware?efi/efivars 用于将固件变量暴露给用户
#
# /dev/shm 用户空间的共享内存对象
# /dev/pts 将内核的伪TTY设备节点暴露给用户
# /dev/mqueue 用于将mqueue IPC对象暴露给用户
# /dev/hugepages 用户空间的API, 用于分配"巨大"内存页
#
# /proc/sys/fs/binfmt_misc 用于在内核中注册二进制格式
#
#---------------------------------------------------------------------------------------------------


#---------------------------------------------------------------------------------------------------
# Service Template
#
# 隐式依赖关系
# - 使用 "Type=dbus" 的Service会自动获取dbus.socket上 "Requires=xxx" 和 "After=xxx" 类型的依赖关系.
# - 套接字激活Service在激活 ".socket" 单元后根据 "After=xxx" 依赖进行自动排序. Service还通过 "Wants=xxx" 和
# "After=xxx" 依赖项拉取在
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#---------------------------------------------------------------------------------------------------