#!/bin/bash

#----------------------------------------------------
# File: systemd-manage.sh
# Contents: systemd manager cmd
# Date: 19-6-5
#----------------------------------------------------

#---------------------------------------------------------------------------------------------------
# journalctl
# systemd启动方式下的日志
#
#   --no-full, --full
#   默认是--full, 显示完整字段. --no-full表示允许内容被truncated(超过一定长度,会被截断)
#
#   -f, --follow
#   仅显示最新的日志分录, 并在将新添加到日志当中的记录打印出来[日志监控].
#
#   -e, --page-end
#   立即跳到日志文件的末尾.
#
#   -n, --lines=num
#   显示最新的num条日志记录. 如果使用--follow, 则隐含此选项. 参数是正整数或"全部"以禁用行限制. 如果没有给出参数,
#   则默认值为10.
#
#   -r, --reverse
#   反向输出, 以便首先显示最新的条目.
#
#   -o, --output=
#   设置显示的日志记录的格式. 采取以下选项之一:
#   - short 默认值,该输出与经典系统日志文件的格式大致相同, 每个日志记录显示一行.
#   - short-iso 类似short, 只是时间使用ISO 8601格式
#   - short-precise 类似short, 只是时间精确到毫秒
#   - cat (查看日志推荐使用) 生成一个非常简洁的输出, 只显示每个日记条目的实际消息,没有元数据,甚至没有时间戳.
#
#   -k, --dmesg
#   仅显示内核消息. 这意味着-b并添加匹配"_TRANSPORT=kernel".
#
#   -t, --identifier=SYSLOG_IDENTIFIER
#   显示指定的syslog标识符SYSLOG_IDENTIFIER的消息. 可以多次指定此参数.
#
#   -u, --unit 
#
#---------------------------------------------------------------------------------------------------