#!/bin/bash

#----------------------------------------------------
# File: upstart.sh
# Contents: upstart.sh
# Date: 19-5-26
#----------------------------------------------------

#---------------------------------------------------------------------------------------------------
# Upstart
#
# Upstart 基于事件机制, 比如U盘插入USB接口后, udev得到内核通知, 发现该设备, 这就是一个新的事件. Upstart在感知该事件
# 之后触发相应的等待任务, 比如处理/etc/fstab中存在的挂载点. 采用这种事件驱动从模式, Upstart完美地解决了即插即用设备带
# 来的新的问题.
#
# 此外, 采用事件驱动机制带来了其他有益的变化, 比如加快的系统启动时间. Sysvinit 运行是同步阻塞的. 一个脚本运行的时候,
# 后续脚本必须等待. 这意味着所有初始化步骤都是串行执行的, 而实际上很多服务彼此并不相关, 完全可以并行启动, 从而减小系统的
# 启动时间.
#
# Chrome OS 使用的是Upstart
#
# Debian7 使用的是 Upstart; Debian8 开始使用 Systemd
#
# Ubuntu 12.04, 14.04, 14.10 使用的是Upstart; Ubuntu 15.04开始使用Systemd
#
# Fedora9 开始使用Upstart; Fedora15 开始使用Systemd
#
# RHEL6 使用Upstart; RHEL7 开始使用Systemd
#
# openSUSE12.1 开始使用Systemd.
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#---------------------------------------------------------------------------------------------------