#!/bin/bash

#----------------------------------------------------
# File: ${NAME}
# Contents: root
# Date: 6/12/19
#----------------------------------------------------


#---------------------------------------------------------------------------------------------------
#
# auto eth0
# 以"auto"开头的行用于标识使用-a选项运行ifup时要启动的物理接口. (此选项由系统引导脚本使用.) 物理接口名称应在同
# 一行上的"auto"后面. 可以有多个"auto"节. ifup按所列顺序启动命名接口.
#
# allow-hotplug eth1
# 以"allow-"开头的行用于标识由各种子系统自动启动的接口. 这可以使用诸如"ifup --allow=hotplug eth0 eth1"之类的命
# 令来完成, 如果它在"allow-hotplug"行中列出, 则只会显示eth0或eth1. 请注意, "allow-auto"和"auto"是同义词.
#
# no-auto-down
# 以"no-auto-down"开头的行用于标识不应被命令"ifdown -a"关闭的接口. 它的主要用途是防止在系统关闭期间关闭接口, 例如,
# 如果根文件系统是网络文件系统, 那么网络接口应该一直保持. 请注意, 仍然可以通过明确指定接口名称来关闭接口.
#
# no-scripts
# 以"no-scripts"开头的行用于标识当这些接口启动或关闭时不应运行/etc/network/if-*.d/中的脚本的接口.
#
# source interfaces.d/machine-dependent
# 以"source"开头的行用于包含来自其他文件的节, 因此可以将配置拆分为多个文件. "source"后跟要获取的文件路径. 可以使用
# Shell通配符.
#
# mapping eth1
#   script /usr/local/sbin/map-scheme
#   map HOME eth0-home
#   map WORK eth0-work
#---------------------------------------------------------------------------------------------------