#!/bin/bash

#----------------------------------------------------
# File: network.sh
# Contents: centos 网络配置
# Date: 8/16/19
#----------------------------------------------------

# 位置: /etc/sysconfig/network-scripts/ifcfg-eth

#---------------------------------------------------------------------------------------------------
# eth0网卡配置:
#
# DEVICE=eth0
# BOOTPROTO=dhcp|static|none         // 网络类型, dhcp动态, static静态, none手动
# ONBOOT=yes                         // 启动加载
#
# HWADDR=00:16:D3:A2:F6:09           // 网卡MAC
# TYPE=Ethernet                      // 网络类型
#
# // 以下的配置是 static 和 none 类型需要设置的点
# IPADDR=192.168.1.108               // IP地址
# NETMASK=255.255.255.0              // 子网掩码
# NETWORK=192.168.1.0                // 网络地址
# BROADCAST=192.168.1.255            // 广播地址
# GATEWAY=192.168.1.1                // 网关地址
#
# // 可选选项
# IPV6INIT=yes                       // 是否支持IPV6
# IPV6_AUTOCONF=yes                  // IPV6是否自动配置
#
#---------------------------------------------------------------------------------------------------

