#!/bin/bash

#----------------------------------------------------
# File: cmd_comple.sh
# Contents: 命令补全设置
# Date: 19-3-25
#----------------------------------------------------


#---------------------------------------------------------------------------------------------------
# 自动命令补全
#
# 在~/.bashrc文件当中添加需要自动补全的命令:
# complete -cf CMD
#
# complete -cf sudo
#
#---------------------------------------------------------------------------------------------------


#---------------------------------------------------------------------------------------------------
# 高级补全方法
#
# 尽管bash原生支持基本的文件名, 命令和变量的自动补全. 仍然可以通过一些方法扩充它的功能.
# 包bash_completion通过将自动补全扩充到一个更加广泛的命令和它们的选项中去使得自动补全在shell中表现更加强大.
#
# 1. 安装bash_completion
# 2. 启动新的shell,由于新的shell由/etc/bash.bashrc的作用自动激活补全. 如果没有, 在/etc/bash.bashrc
# 当中追加如下内容:
# if ! shopt -oq posix; then
#   if [ -f /usr/share/bash-completion/bash_completion ]; then
#     . /usr/share/bash-completion/bash_completion
#   elif [ -f /etc/bash_completion ]; then
#     . /etc/bash_completion
#   fi
# fi
#
#---------------------------------------------------------------------------------------------------


#---------------------------------------------------------------------------------------------------
# 更快的补全操作
#
# 通过将下面的内容添加到readline默认的初始化文件(~/.inputrc或者/etc/inputrc中):
# set show-all-if-ambiguous on
#
# 之后敲击一次Tab就可以实现命令补全.
#
#---------------------------------------------------------------------------------------------------